# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------

brew "git" # Distributed revision control system - https://git-scm.com
brew "git-lfs" # Git extension for versioning large files - https://git-lfs.github.com/
brew "autojump" # history based directory navigation  - https://github.com/wting/autojump
brew "zsh" # Z-Shell : https://github.com/zsh-users/zsh
brew "coreutils" # GNU File, Shell, and Text utilities - https://www.gnu.org/software/coreutils
brew "lsd" # replacement for ls. https://github.com/lsd-rs/lsd
brew "gh" # github command line interface - https://github.com/cli/cli
brew "glow" # Render markdown on the CLI https://github.com/charmbracelet/glow
brew "htop" # cross-platform interactive process viewer https://github.com/htop-dev/htop/
brew "mcfly" # improve shell h istory search - https://github.com/cantino/mcfly
brew "mkcert" # local dev certificates - https://github.com/FiloSottile/mkcert
brew "nss" # Network Security Services - https://github.com/nss-dev/nss
brew "tree" # source tree printout - http://mama.indstate.edu/users/ice/tree/
brew "topgrade" # Upgrade all the things - https://github.com/topgrade-rs/topgrade
brew "terminal-notifier" # send notifications from the terminal - https://github.com/julienXX/terminal-notifier
brew "tlrc" # simpler, more approachable complement to traditional man pages - https://github.com/tldr-pages/tldr
brew "bat" # cat with syntax highlighting - https://github.com/sharkdp/bat
brew "youtube-dl" # commandline tool to download youtube and other media - https://github.com/ytdl-org/youtube-dl
brew "mas" # Mac App Store command-line interface - https://github.com/mas-cli/mas
brew "ffmpeg" # multimedia handling - https://github.com/FFmpeg/FFmpeg
brew "tesseract-lang" # languages for OCR - https://github.com/tesseract-ocr/tesseract
brew "qpdf" # content-preserving transformations on PDF files - https://github.com/qpdf/qpdf
brew "ocrmypdf" # OCR PDF Files (tesseract abstraction) - https://github.com/ocrmypdf/OCRmyPDF
brew "m-cli" # macOS command line tool - https://github.com/rgcr/m-cli
brew "ffmpeg" # Play, record, convert, and stream audio and video - https://ffmpeg.org/
brew "composer" # Dependency Manager for PHP - https://getcomposer.org/
brew "gifsicle" # GIF image/animation creator/editor - https://www.lcdf.org/gifsicle/

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------


# ------------------------------------------------------------------------------
# Casks
# ------------------------------------------------------------------------------

# Desktop
cask "1password"
cask "alfred"
cask "fliqlo"
cask "keycastr"
cask "marked"
cask "obsidian"
cask "rocket"
cask "spotify"
cask "typeface"
cask "airfoil"

# Utils
cask "monitorcontrol"
cask "little-snitch"
cask "divvy"
cask "contexts"
cask "micro-snitch"
cask "hazel"
cask "bluesnooze" # https://github.com/odlp/bluesnooze
cask "beardedspice"
cask "bartender"
cask "maestral" # https://github.com/samschott/maestral

# Development
cask "visual-studio-code"
cask "transmit"
cask "tower"
cask "kaleidoscope2"
cask "docker"
cask "fig"
cask "iterm2"

# Browser
cask "firefox-developer-edition"
cask "firefox"
cask "google-chrome"
cask "chromium"

# Quicklook Plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "qlimagesize" # https://github.com/Nyx0uf/qlImageSize
cask "webpquicklook" # https://github.com/dchest/webp-quicklook
cask "qlmarkdown" # https://github.com/sbarex/QLMarkdown

# ------------------------------------------------------------------------------
# Mac Appstore Applications
# ------------------------------------------------------------------------------

mas "StopTheMadness", id: 1376402589
mas "Drafts", id: 1435957248
mas "Gifox 2: GIF Recorder & Editor", id: 1461845568
mas "Dato", id: 1470584107
mas "Instapaper Save", id: 1481302432
mas "Hand Mirror", id: 1502839586
mas "Pi-Hole Remote" , id: 1515445551
mas "Refined Github", id: 1519867270
mas "TextSniper", id: 1528890965
mas "Reeder", id: 1529448980
mas "Color Picker", id: 1545870783
mas "Play", id: 1596506190
mas "Velia", id: 1607635845
mas "UnTrap", id: 1637438059
mas "The Magic Highlighter", id: 1663033087
mas "Deliveries", id: 290986013
mas "Short Menu", id: 510109287
mas "Dropmark", id: 554314609
mas "Command X", id: 6448461551
mas "Things", id: 904280696
mas "Amphetamine", id: 937984704
mas "Sequel Ace", id: 1518036000
mas "Spark", id: 1176895641
mas "ytdistract", id: 1637438059
mas "1Password for Safari", id: 1569813296